In [1]:
# Create a Pandas Data frame with two columns (Value1 and Value2) with some Numeric and some Categorical values and perform following operation on it.

# 1.	Convert all values from data frame into float format and print it.
# 2.	Drop all the rows with the NaN values from data frame.
# 3.	Replace the NaN values with 0’s
# 4.	Transpose the given data frame.
# 5.	Rename the default index with X, Y, Z and then transpose data frame.

In [10]:
import pandas as pd
import numpy as np
data={'Value1':[1,"sham",3,4,5,"raj",4],
      'Value2':[4,"rani",6,3,6,3,"geeta"]}
df=pd.DataFrame(data)
df

  Value1 Value2
0      1      4
1   sham   rani
2      3      6
3      4      3
4      5      6
5    raj      3
6      4  geeta

In [11]:
# 1.	Convert all values from data frame into float format and print it.
df=df.apply(pd.to_numeric,errors="coerce")
df

   Value1  Value2
0     1.0     4.0
1     NaN     NaN
2     3.0     6.0
3     4.0     3.0
4     5.0     6.0
5     NaN     3.0
6     4.0     NaN

In [12]:
# 2.Drop all the rows with the NaN values from data frame.
no_nan_df=df.dropna()
print(no_nan_df)

   Value1  Value2
0     1.0     4.0
2     3.0     6.0
3     4.0     3.0
4     5.0     6.0

In [14]:
# 3.	Replace the NaN values with 0’s
fill_with_zero=df.fillna(0)
print(fill_with_zero)

   Value1  Value2
0     1.0     4.0
1     0.0     0.0
2     3.0     6.0
3     4.0     3.0
4     5.0     6.0
5     0.0     3.0
6     4.0     0.0

In [16]:
# 4.	Transpose the given data frame.
transpose=fill_with_zero.transpose()
print(transpose)

          0    1    2    3    4    5    6
Value1  1.0  0.0  3.0  4.0  5.0  0.0  4.0
Value2  4.0  0.0  6.0  3.0  6.0  3.0  0.0

In [18]:
# 5.	Rename the default index with X, Y, Z and then transpose data frame.
df=df.dropna();
df

   Value1  Value2
2     3.0     6.0
3     4.0     3.0
4     5.0     6.0

In [26]:
# 5.	Rename the default index with X, Y, Z and then transpose data frame.
df=df.reset_index(drop=True)
print(df)
df = df.rename(index={0: 'X', 1: 'Y', 2: 'Z'})
print('\n')
print(df);
transpose=df.transpose()
print('\n')
print(transpose);

   Value1  Value2
0     3.0     6.0
1     4.0     3.0
2     5.0     6.0


   Value1  Value2
X     3.0     6.0
Y     4.0     3.0
Z     5.0     6.0


          X    Y    Z
Value1  3.0  4.0  5.0
Value2  6.0  3.0  6.0